cask_args appdir: "/Applications"

# backup
# brew "mas"
# brew "mackup"

# util command
brew "coreutils"
brew "curl"
brew "tree"
brew "watch"
brew "grep"
brew "ripgrep"
brew "jq"
brew "nkf"
brew "tealdeer"
brew "fzf"
brew "bat"
brew "exa"
brew "zoxide"

# cli command
brew "awscli"
brew "kubectl"

# git
brew "git"
brew "ghq"
tap "github/gh"
brew "gh"

# prompt
brew "starship"

# dotfiles
brew "stow"
brew "shellcheck"

# package manager
brew "npm"
# brew "yarn"
brew "volta"
# brew "ndenv"
# brew "node-build"
brew "goenv"
brew "rbenv"
# brew "ruby-build"

# application
brew "openssl"
# brew "postgresql@14"
# brew "mysql@5.7"
# tap "heroku/brew"
# brew "heroku"
brew "neovim"

# kubenates
brew "kustomize"
brew "stern"

# other
# brew "fswatch" # docker-sync gem
# brew "unison" # docker-sync gem
brew "shared-mime-info" # mimemagic gem

# cask "dropbox"
cask "iterm2"
cask "google-chrome"
cask "google-japanese-ime"
# cask "firefox"
cask "alfred"
cask "clipy"
cask "visual-studio-code"
cask "tableplus"
# cask "sequel-pro"
# cask "mysqlworkbench" バージョンが新しすぎるためてブラウザからダウンロード(6.3.10)
# cask "slack"
cask "zoom"
cask "docker"
# cask "sourcetree"
cask "ngrok"
# cask "kindle"
# cask "appcleaner"
# cask "mapture" homebrewからinstallできなくなった
# tap "jason0x43/homebrew-neovim-nightly"
# tap "austinliuigi/brew-neovim-nightly", "https://github.com/austinliuigi/brew-neovim-nightly.git"
# cask "neovim-nightly"
# tap "homebrew/cask-fonts"
# cask "font-hack-nerd-font"

# mas "LINE", id: 539883307
# mas "Microsoft OneNote", id: 784801555
# mas "Duplicate Photos Fixer Pro", id: 963642514
